backend/app/models/dish.rb

INSERT INTO "meals" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", " Dinner"], ["created_at", "2021-04-15 20:55:22.311811"], ["updated_at", "2021-04-15 20:55:22.311811"]]
SELECT "meals".* FROM "meals" WHERE "meals"."name" = $1 LIMIT $2  [["name", " Dinner"], ["LIMIT", 1]]
---
  def meal_attributes=(name)
    self.meal = meal.find_or_create_by(name: name)