backend/app/controllers/dishes_controller.rb

INSERT INTO "dishes" ("name", "notes", "meal_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", " Chicken "], ["notes", " pick yo chicken "], ["meal_id", 5], ["created_at", "2021-04-16 01:42:35.773535"], ["updated_at", "2021-04-16 01:42:35.773535"]]
---
  def create
    @dish = Dish.new(dish_params)

    if @dish.save

DELETE FROM "dishes" WHERE "dishes"."id" = $1  [["id", 6]]
---
  def destroy
    @dish.destroy